zephyrproject-rtos/hal_nxp/dts/nxp/mcx/MCXC144VFT-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MCXC144VFT/signal_configuration.xml
 *
 * Copyright 2024, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MCXC244VFM-pinctrl.h with this part's differences applied
 * below (8 removed, 0 changed,
 * 96 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 5d6c3ebd99fe3616
 */

#ifndef _ZEPHYR_DTS_BINDING_MCXC144VFT_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MCXC144VFT_WRAPPER_

#include "MCXC244VFM-pinctrl.h"

/* Signals not present on this part */
#undef CLKOUT32K_PTE0
#undef CMP0_OUT_PTE0
#undef I2C1_SDA_PTE0
#undef LPUART1_TX_PTE0
#undef PTE0
#undef RTC_CLKOUT_PTE0
#undef SPI1_MISO_PTE0
#undef USB_SOF_OUT_PTC7

/* Signals specific to this part */
#define ADC0_DM0_PTE21 KINETIS_MUX('E',21,0)
#define ADC0_DM1_PTE17 KINETIS_MUX('E',17,0)
#define ADC0_DM2_PTE19 KINETIS_MUX('E',19,0)
#define ADC0_DP0_PTE20 KINETIS_MUX('E',20,0)
#define ADC0_DP1_PTE16 KINETIS_MUX('E',16,0)
#define ADC0_DP2_PTE18 KINETIS_MUX('E',18,0)
#define ADC0_SE0_PTE20 KINETIS_MUX('E',20,0)
#define ADC0_SE12_PTB2 KINETIS_MUX('B',2,0)
#define ADC0_SE13_PTB3 KINETIS_MUX('B',3,0)
#define ADC0_SE14_PTC0 KINETIS_MUX('C',0,0)
#define ADC0_SE1_PTE16 KINETIS_MUX('E',16,0)
#define ADC0_SE2_PTE18 KINETIS_MUX('E',18,0)
#define ADC0_SE4a_PTE21 KINETIS_MUX('E',21,0)
#define ADC0_SE4b_PTE29 KINETIS_MUX('E',29,0)
#define ADC0_SE5a_PTE17 KINETIS_MUX('E',17,0)
#define ADC0_SE5b_PTD1 KINETIS_MUX('D',1,0)
#define ADC0_SE6a_PTE19 KINETIS_MUX('E',19,0)
#define CMP0_IN5_PTE29 KINETIS_MUX('E',29,0)
#define CMP0_OUT_PTC0 KINETIS_MUX('C',0,5)
#define EXTRG_IN_PTC0 KINETIS_MUX('C',0,3)
#define FXIO0_D0_PTD0 KINETIS_MUX('D',0,6)
#define FXIO0_D0_PTE16 KINETIS_MUX('E',16,6)
#define FXIO0_D1_PTD1 KINETIS_MUX('D',1,6)
#define FXIO0_D1_PTE17 KINETIS_MUX('E',17,6)
#define FXIO0_D2_PTD2 KINETIS_MUX('D',2,6)
#define FXIO0_D2_PTE18 KINETIS_MUX('E',18,6)
#define FXIO0_D3_PTD3 KINETIS_MUX('D',3,6)
#define FXIO0_D3_PTE19 KINETIS_MUX('E',19,6)
#define FXIO0_D4_PTE20 KINETIS_MUX('E',20,6)
#define FXIO0_D5_PTE21 KINETIS_MUX('E',21,6)
#define I2C0_SCL_PTB2 KINETIS_MUX('B',2,2)
#define I2C0_SCL_PTE19 KINETIS_MUX('E',19,4)
#define I2C0_SCL_PTE24 KINETIS_MUX('E',24,5)
#define I2C0_SDA_PTB3 KINETIS_MUX('B',3,2)
#define I2C0_SDA_PTE18 KINETIS_MUX('E',18,4)
#define I2C0_SDA_PTE25 KINETIS_MUX('E',25,5)
#define I2S0_TXD0_PTC0 KINETIS_MUX('C',0,6)
#define LPTMR0_ALT3_PTE17 KINETIS_MUX('E',17,5)
#define LPUART0_RX_PTB16 KINETIS_MUX('B',16,3)
#define LPUART0_RX_PTE21 KINETIS_MUX('E',21,4)
#define LPUART0_TX_PTB17 KINETIS_MUX('B',17,3)
#define LPUART0_TX_PTE20 KINETIS_MUX('E',20,4)
#define PTB16 KINETIS_MUX('B',16,1)
#define PTB17 KINETIS_MUX('B',17,1)
#define PTB2 KINETIS_MUX('B',2,1)
#define PTB3 KINETIS_MUX('B',3,1)
#define PTC0 KINETIS_MUX('C',0,1)
#define PTD0 KINETIS_MUX('D',0,1)
#define PTD1 KINETIS_MUX('D',1,1)
#define PTD2 KINETIS_MUX('D',2,1)
#define PTD3 KINETIS_MUX('D',3,1)
#define PTE16 KINETIS_MUX('E',16,1)
#define PTE17 KINETIS_MUX('E',17,1)
#define PTE18 KINETIS_MUX('E',18,1)
#define PTE19 KINETIS_MUX('E',19,1)
#define PTE20 KINETIS_MUX('E',20,1)
#define PTE21 KINETIS_MUX('E',21,1)
#define PTE24 KINETIS_MUX('E',24,1)
#define PTE25 KINETIS_MUX('E',25,1)
#define PTE29 KINETIS_MUX('E',29,1)
#define SPI0_MISO_PTD2 KINETIS_MUX('D',2,5)
#define SPI0_MISO_PTD3 KINETIS_MUX('D',3,2)
#define SPI0_MISO_PTE18 KINETIS_MUX('E',18,5)
#define SPI0_MISO_PTE19 KINETIS_MUX('E',19,2)
#define SPI0_MOSI_PTD2 KINETIS_MUX('D',2,2)
#define SPI0_MOSI_PTD3 KINETIS_MUX('D',3,5)
#define SPI0_MOSI_PTE18 KINETIS_MUX('E',18,2)
#define SPI0_MOSI_PTE19 KINETIS_MUX('E',19,5)
#define SPI0_SCK_PTD1 KINETIS_MUX('D',1,2)
#define SPI0_SCK_PTE17 KINETIS_MUX('E',17,2)
#define SPI0_SS_PTD0 KINETIS_MUX('D',0,2)
#define SPI0_SS_PTE16 KINETIS_MUX('E',16,2)
#define SPI1_MISO_PTB16 KINETIS_MUX('B',16,5)
#define SPI1_MISO_PTB17 KINETIS_MUX('B',17,2)
#define SPI1_MOSI_PTB16 KINETIS_MUX('B',16,2)
#define SPI1_MOSI_PTB17 KINETIS_MUX('B',17,5)
#define TPM0_CH0_PTD0 KINETIS_MUX('D',0,4)
#define TPM0_CH0_PTE24 KINETIS_MUX('E',24,3)
#define TPM0_CH1_PTD1 KINETIS_MUX('D',1,4)
#define TPM0_CH1_PTE25 KINETIS_MUX('E',25,3)
#define TPM0_CH2_PTD2 KINETIS_MUX('D',2,4)
#define TPM0_CH2_PTE29 KINETIS_MUX('E',29,3)
#define TPM0_CH3_PTD3 KINETIS_MUX('D',3,4)
#define TPM1_CH0_PTE20 KINETIS_MUX('E',20,3)
#define TPM1_CH1_PTE21 KINETIS_MUX('E',21,3)
#define TPM2_CH0_PTB2 KINETIS_MUX('B',2,3)
#define TPM2_CH1_PTB3 KINETIS_MUX('B',3,3)
#define TPM_CLKIN0_PTB16 KINETIS_MUX('B',16,4)
#define TPM_CLKIN0_PTE16 KINETIS_MUX('E',16,4)
#define TPM_CLKIN0_PTE29 KINETIS_MUX('E',29,4)
#define TPM_CLKIN1_PTB17 KINETIS_MUX('B',17,4)
#define TPM_CLKIN1_PTE17 KINETIS_MUX('E',17,4)
#define UART2_RX_PTD2 KINETIS_MUX('D',2,3)
#define UART2_RX_PTE17 KINETIS_MUX('E',17,3)
#define UART2_TX_PTD3 KINETIS_MUX('D',3,3)
#define UART2_TX_PTE16 KINETIS_MUX('E',16,3)

#endif /* _ZEPHYR_DTS_BINDING_MCXC144VFT_WRAPPER_ */
